In [1]:
import warnings
warnings.simplefilter("ignore")

In [2]:
import pandas as pd
import numpy as np
import duckdb
import matplotlib.pyplot as plt
import seaborn as sns

# 1. Load data

olist_customers_dataset

In [3]:
df_customer = pd.read_csv('./dataset/olist_customers_dataset.csv')

In [4]:
df_customer.head()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [5]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

olist_geolocation_dataset

In [6]:
df_geo = pd.read_csv('./dataset/olist_geolocation_dataset.csv')

In [7]:
df_geo.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

In [8]:
df_geo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000163 entries, 0 to 1000162
Data columns (total 5 columns):
 #   Column                       Non-Null Count    Dtype
---  ------                       --------------    -----
 0   geolocation_zip_code_prefix  1000163 non-null  int64
 1   geolocation_lat              1000163 non-null  float64
 2   geolocation_lng              1000163 non-null  float64
 3   geolocation_city             1000163 non-null  object
 4   geolocation_state            1000163 non-null  object
dtypes: float64(2), int64(1), object(2)
memory usage: 38.2+ MB

olist_order_items_dataset

In [9]:
df_order_item = pd.read_csv('./dataset/olist_order_items_dataset.csv')

In [10]:
df_order_item.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [11]:
df_order_item.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  object
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB

In [12]:
df_order_item['shipping_limit_date'] = pd.to_datetime(df_order_item['shipping_limit_date'])

olist_order_payments_dataset

In [13]:
df_order_payment = pd.read_csv('./dataset/olist_order_payments_dataset.csv')

In [14]:
df_order_payment.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [15]:
df_order_payment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

olist_order_reviews_dataset

In [16]:
df_order_review = pd.read_csv('./dataset/olist_order_reviews_dataset.csv')

In [17]:
df_order_review.head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,NaN,NaN,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,NaN,NaN,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
3,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,NaN,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
4,f7c4243c7fe1938f181bec41a392bdeb,8e6bfb81e283fa7e4f11123a3fb894f1,5,NaN,Parabéns lojas lannister adorei comprar pela I...,2018-03-01 00:00:00,2018-03-02 10:26:53

In [18]:
df_order_review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99224 entries, 0 to 99223
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   review_id                99224 non-null  object
 1   order_id                 99224 non-null  object
 2   review_score             99224 non-null  int64
 3   review_comment_title     11568 non-null  object
 4   review_comment_message   40977 non-null  object
 5   review_creation_date     99224 non-null  object
 6   review_answer_timestamp  99224 non-null  object
dtypes: int64(1), object(6)
memory usage: 5.3+ MB

In [19]:
df_order_review['review_creation_date'] = pd.to_datetime(df_order_review['review_creation_date'])
df_order_review['review_answer_timestamp'] = pd.to_datetime(df_order_review['review_answer_timestamp'])

olist_orders_dataset

In [20]:
df_order = pd.read_csv('./dataset/olist_orders_dataset.csv')

In [21]:
df_order.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [22]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  object
 4   order_approved_at              99281 non-null  object
 5   order_delivered_carrier_date   97658 non-null  object
 6   order_delivered_customer_date  96476 non-null  object
 7   order_estimated_delivery_date  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB

In [23]:
df_order['order_purchase_timestamp'] = pd.to_datetime(df_order['order_purchase_timestamp'])
df_order['order_approved_at'] = pd.to_datetime(df_order['order_approved_at'])
df_order['order_delivered_carrier_date'] = pd.to_datetime(df_order['order_delivered_carrier_date'])
df_order['order_delivered_customer_date'] = pd.to_datetime(df_order['order_delivered_customer_date'])
df_order['order_estimated_delivery_date'] = pd.to_datetime(df_order['order_estimated_delivery_date'])

olist_products_dataset

In [24]:
df_product = pd.read_csv('./dataset/olist_products_dataset.csv')

In [25]:
df_product.head()

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [26]:
df_product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product_category_name       32341 non-null  object
 2   product_name_lenght         32341 non-null  float64
 3   product_description_lenght  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB

olist_sellers_dataset

In [27]:
df_seller = pd.read_csv('./dataset/olist_sellers_dataset.csv')

In [28]:
df_seller.head()

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,braganca paulista,SP

In [29]:
df_seller.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   int64
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

product_category_name_translation

In [30]:
df_cat_name = pd.read_csv('./dataset/product_category_name_translation.csv')

In [31]:
df_cat_name.head()

    product_category_name product_category_name_english
0            beleza_saude                 health_beauty
1  informatica_acessorios         computers_accessories
2              automotivo                          auto
3         cama_mesa_banho                bed_bath_table
4        moveis_decoracao               furniture_decor

In [32]:
df_cat_name.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71 entries, 0 to 70
Data columns (total 2 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   product_category_name          71 non-null     object
 1   product_category_name_english  71 non-null     object
dtypes: object(2)
memory usage: 1.2+ KB

olist_age

In [33]:
df_age = pd.read_csv('./dataset/olist_age.csv')

In [34]:
df_age.head()

                        customer_id  age
0  00012a2ce6f8dcda20d059ce98491703   61
1  000161a058600d5901f007fab4c27140   49
2  0001fd6190edaaf884bcaf3d49edf079   71
3  0002414f95344307404f0ace7a26f1d5   68
4  000379cdec625522490c315e70c7a9fb   61

In [35]:
df_age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98666 entries, 0 to 98665
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  98666 non-null  object
 1   age          98666 non-null  int64
dtypes: int64(1), object(1)
memory usage: 1.5+ MB

# 2. Feature engineering

1. customer_id

In [36]:
df_customer_unique_id = duckdb.query("""
select distinct customer_unique_id
from df_customer
""").to_df()

In [37]:
df_customer_unique_id

                     customer_unique_id
0      2a7745e1ed516b289ed9b29c7d0539a5
1      918dc87cd72cd9f6ed4bd442ed785235
2      bf4862777db128507e9efcc789215e9b
3      d251c190ca75786e9ab937982d60d1d4
4      76b029c87118a29f2e3de420f5ec2fa2
...                                 ...
96091  b80c1a7b76e8104245be223374df5fd9
96092  3011394a1b8d1b04e425dd5dc77cbaaf
96093  046470763123d3d6364f89095b4e47ab
96094  15637b62dfa4c5a9df846b22beef0994
96095  e7f8760e2bbd2f1986bebd99596c088e

[96096 rows x 1 columns]

2. number of sub account

In [38]:
df_customer_no_acc = duckdb.query("""
select customer_unique_id, count(customer_id) as no_account
from df_customer
group by customer_unique_id
order by no_account desc
""").to_df()

In [39]:
df_customer_no_acc

                     customer_unique_id  no_account
0      8d50f5eadf50201ccdcedfb9e2ac8455          17
1      3e43e6105506432c953e165fb2acf44c           9
2      6469f99c1f9dfae7733b25662e7f1782           7
3      1b6c7548a2a1f9037c1fd3ddfed95f33           7
4      ca77025e7201e3b30c44b472ff346268           7
...                                 ...         ...
96091  206e64e8af2633a2ebe158a7fcb860db           1
96092  4452b8ef472646c4cc042cb31a291f3b           1
96093  57c2cfb4a80b13ed19b5fb258d29c19d           1
96094  ca186065de6e2d01cfc99763e6d62048           1
96095  84732c5050c01db9b23e19ba39899398           1

[96096 rows x 2 columns]

3. customer address

In [40]:
df_customer_address = duckdb.query("""
select customer_unique_id
, case when customer_state in ('AC', 'AP', 'AM', 'PA', 'RO', 'RR', 'TO') then 1 else 0 end north
, case when customer_state in ('AL', 'BA', 'CE', 'MA', 'PB', 'PE', 'PI', 'RN', 'SE') then 1 else 0 end northeast
, case when customer_state in ('DF', 'GO', 'MT', 'MS') then 1 else 0 end central_west
, case when customer_state in ('ES', 'MG', 'RJ', 'SP') then 1 else 0 end southeast
, case when customer_state in ('PR', 'RS', 'SC') then 1 else 0 end south
from
    (
    select customer_unique_id, customer_state, customer_city, customer_zip_code_prefix
    , row_number() over(partition by customer_unique_id order by customer_zip_code_prefix) rn
    from df_customer
    ) a
where rn = 1
""").to_df()

In [41]:
df_customer_address

,customer_unique_id,north,northeast,central_west,southeast,south
0,0005e1862207bf6ccc02e4228effd9a0,0,0,0,1,0
1,0015752e079902b12cd00b9b7596276b,0,0,0,1,0
2,001a2bf0e46c684031af91fb2bce149d,0,0,0,1,0
3,003db7adfcdc49857b095a50191b6c9d,0,0,0,1,0
4,0059acd36094bf670ec8b21be6c0044c,0,0,0,1,0
...,...,...,...,...,...,...
96091,ffc4e1cd8aa220763480d0a18157c45d,0,0,0,1,0
96092,ffdd1e311843bb858885335ae77bb97a,0,0,0,1,0
96093,fff3e1d7bc75f11dc7670619b2e61840,0,1,0,0,0
96094,fffcf5a5ff07b0908bd4e2dbc735a684,0,1,0,0,0
96095,ffff5962728ec6157033ef9805bacc48,0,0,0,1,0

4. Frequency

In [42]:
duckdb.query("""
select max(cast(order_purchase_timestamp as datetime)) max_date from df_order
""").to_df()

             max_date
0 2018-10-17 17:30:18

In [43]:
df_customer_frequency = duckdb.query("""
select b.customer_unique_id
, count(distinct order_id) no_order
, max(datediff('month',cast(order_purchase_timestamp as datetime),cast('2018-11-01' as datetime))) account_age_month
, count(distinct order_id)/
min(datediff('month',cast(order_purchase_timestamp as datetime),cast('2018-11-01' as datetime))) order_per_month
from df_order a
left join df_customer b
on a.customer_id = b.customer_id
where a.order_status not in ('unavailable','canceled')
and a.order_purchase_timestamp is not null
group by b.customer_unique_id
""").to_df()

In [44]:
df_customer_frequency

,customer_unique_id,no_order,account_age_month,order_per_month
0,57b2a98a409812fe9618067b6b8ebe4f,1,12,0.083333
1,21f748a16f4e1688a9014eb3ee6fa325,1,10,0.100000
2,a96d5cfa0d3181817e2b946f921ea021,1,13,0.076923
3,e9dd12dca17352644a959d9dea133935,2,8,0.285714
4,e079b18794454de9d2be5c12b4392294,2,17,0.117647
...,...,...,...,...
94985,d385d86ff15a721b213924f5f6b8316f,1,3,0.333333
94986,919decef1f13a9b93ed6cca4af6a8c2f,1,20,0.050000
94987,591373b45f940c1da643522fa4300753,1,12,0.083333
94988,6ff6f2913b97c58e8c0a4c96d8de6158,1,7,0.142857
94989,a10c0d1e68e919e3d91ed940a0ba6aed,1,14,0.071429

5. Monetary

In [45]:
df_customer_monetary = duckdb.query("""
select b.customer_unique_id
, count(distinct a.order_id) no_order
, sum(c.price) amount             
, max(datediff('month',cast(order_purchase_timestamp as datetime),cast('2018-11-01' as datetime))) account_age_month         
, sum(c.price)/count(distinct a.order_id) amount_per_order
, sum(c.price)/
max(datediff('month',cast(order_purchase_timestamp as datetime),cast('2018-11-01' as datetime))) amount_per_month
from df_order a
left join df_customer b
on a.customer_id = b.customer_id
left join df_order_item c
on a.order_id = c.order_id
where a.order_status not in ('unavailable','canceled')
and a.order_purchase_timestamp is not null
group by b.customer_unique_id
""").to_df()

In [46]:
df_customer_monetary

,customer_unique_id,no_order,amount,account_age_month,amount_per_order,amount_per_month
0,861eff4711a542e4b93843c6dd7febb0,1,124.99,18,124.99,6.943889
1,482441ea6a06b1f72fe9784756c0ea75,1,148.00,6,148.00,24.666667
2,dd992305cba295d997f263dbdf4e8c2e,1,34.99,9,34.99,3.887778
3,66cc90195ca44cc7ac6a1cd0e1e1e7b2,1,16.48,13,16.48,1.267692
4,d85547cd859833520b311b4458a14c1c,1,788.42,17,788.42,46.377647
...,...,...,...,...,...,...
94985,7e8aeee428a0d1aa0586279be4291446,1,57.99,11,57.99,5.271818
94986,afd298f910efb99d602e27b71e1e8ae9,1,98.00,16,98.00,6.125000
94987,5b66137675c164a7df3b639bf1e86134,1,13.47,4,13.47,3.367500
94988,b9adc8737de57264a2899e33dbb78dc0,1,124.90,6,124.90,20.816667
94989,442ec7926cde07b2c855a5e100e345c5,1,15.90,5,15.90,3.180000

6. Recency

In [47]:
df_customer_recency = duckdb.query("""
select b.customer_unique_id
, max(cast(order_purchase_timestamp as datetime)) lastest_txn
, min(datediff('day', cast(order_purchase_timestamp as datetime), cast('2018-11-01' as datetime))) as day_after_last_pur
from df_order a
left join df_customer b on a.customer_id = b.customer_id
where a.order_status not in ('unavailable','canceled')
and a.order_purchase_timestamp is not null
group by b.customer_unique_id
""").to_df()

In [48]:
df_customer_recency

,customer_unique_id,lastest_txn,day_after_last_pur
0,345ecd01c38d18a9036ed96c73b8d066,2018-07-29 09:51:30,95
1,9afe194fb833f79e300e37e580171f22,2018-01-08 11:22:34,297
2,7f3a72e8f988c6e735ba118d54f47458,2017-05-11 13:48:47,539
3,07d190f123147d9e89d4b922543d7948,2018-07-08 09:59:19,116
4,c9158d089637ab443c78984d20da7fc0,2018-01-31 16:43:25,274
...,...,...,...
94985,68007a0f95654b7c1a9ea4bc129926d2,2017-08-16 20:53:13,442
94986,039a597bb045646b899477a8480bdd93,2017-04-30 19:14:32,550
94987,e43791904cdd435a8b255093becdada0,2018-02-24 11:46:26,250
94988,7218da49ef6bca3a8d862b83e6112cf5,2018-04-02 15:37:39,213
94989,db634985638ec4b6abf8734d7adde1ab,2017-06-23 10:55:02,496

7. age

In [49]:
df_customer_age = duckdb.query("""
select b.customer_unique_id
, min(a.age) age
from df_age a
left join df_customer b
on a.customer_id = b.customer_id
group by b.customer_unique_id
""").to_df()

In [50]:
df_customer_age

                     customer_unique_id  age
0      14843983d4a159080f6afe4b7f346e7c   43
1      ed5340f0e2a52fffa065298aeb875e60   53
2      dbedaa0402e0dfa8b90fb9557424c5fc   68
3      589621a1ce8b9302b75d6920dfd7dd01   21
4      74c286ab8cc161142213780711964b06   67
...                                 ...  ...
95415  4b66b83ef70065c79f4ebe6875902f3f   56
95416  3de473dafcdf00614810c9eb37ee2cd7   31
95417  587b326ba3bf8aa4d3e50fb1f38ea79f   69
95418  ccbc9ad1e581dceecfb8638696ef5475   68
95419  a4088da2ae451b8effea80bc96d363dc   36

[95420 rows x 2 columns]

In [51]:
**

SyntaxError: invalid syntax (402238255.py, line 1)

# 3. Join data

In [55]:
duckdb.query("""
select *
from df_customer_recency    
""").to_df()

,customer_unique_id,lastest_txn,day_after_last_pur
0,345ecd01c38d18a9036ed96c73b8d066,2018-07-29 09:51:30,95
1,9afe194fb833f79e300e37e580171f22,2018-01-08 11:22:34,297
2,7f3a72e8f988c6e735ba118d54f47458,2017-05-11 13:48:47,539
3,07d190f123147d9e89d4b922543d7948,2018-07-08 09:59:19,116
4,c9158d089637ab443c78984d20da7fc0,2018-01-31 16:43:25,274
...,...,...,...
94985,68007a0f95654b7c1a9ea4bc129926d2,2017-08-16 20:53:13,442
94986,039a597bb045646b899477a8480bdd93,2017-04-30 19:14:32,550
94987,e43791904cdd435a8b255093becdada0,2018-02-24 11:46:26,250
94988,7218da49ef6bca3a8d862b83e6112cf5,2018-04-02 15:37:39,213
94989,db634985638ec4b6abf8734d7adde1ab,2017-06-23 10:55:02,496

In [58]:
df = duckdb.query("""
select a.customer_unique_id
, b.no_account
, c.north, c.northeast, c.central_west, c.southeast, c.south
, d.order_per_month
, e.amount_per_order, e.amount_per_month
, f.age
from df_customer_unique_id a
left join df_customer_no_acc b
on a.customer_unique_id = b.customer_unique_id
left join df_customer_address c
on a.customer_unique_id = c.customer_unique_id
left join df_customer_frequency d
on a.customer_unique_id = d.customer_unique_id
left join df_customer_monetary e
on a.customer_unique_id = e.customer_unique_id
left join df_customer_age f
on a.customer_unique_id = f.customer_unique_id            
""").to_df()

In [59]:
df.head()

,customer_unique_id,no_account,north,northeast,central_west,southeast,south,order_per_month,amount_per_order,amount_per_month,age
0,2a7745e1ed516b289ed9b29c7d0539a5,1,0,0,0,1,0,0.083333,25.30,2.108333,67.0
1,918dc87cd72cd9f6ed4bd442ed785235,1,0,0,0,1,0,0.071429,99.00,7.071429,50.0
2,bf4862777db128507e9efcc789215e9b,1,0,0,0,1,0,0.083333,49.00,4.083333,25.0
3,d251c190ca75786e9ab937982d60d1d4,1,0,0,0,1,0,0.142857,23.98,3.425714,65.0
4,76b029c87118a29f2e3de420f5ec2fa2,1,0,0,0,1,0,0.090909,340.63,30.966364,72.0

In [60]:
df.isnull().sum()

customer_unique_id       0
no_account               0
north                    0
northeast                0
central_west             0
southeast                0
south                    0
order_per_month       1106
amount_per_order      1113
amount_per_month      1113
age                    676
dtype: int64